github.token=${GITHUB_TOKEN}
github.repository=Broscorp-net/traineeship

slack.webhook="${SLACK_WEBHOOK}"
slack.token=${SLACK_TOKEN}

# database
spring.jpa.database=POSTGRESQL
spring.jpa.show-sql=true
spring.datasource.platform=postgres
spring.jpa.generate-ddl=true
spring.jpa.hibernate.ddl-auto=none
spring.jpa.properties.hibernate.dialect=org.hibernate.dialect.PostgreSQLDialect
spring.datasource.driver-class-name=org.postgresql.Driver
spring.datasource.url=${DB_URL}
spring.datasource.username=${DB_USER_NAME}
spring.datasource.password=${DB_PASSWORD}


idOfSlackBot=UQWD538CT
#messages for bot
welcome=Welcome to the club buddy :dealwithit:
checkNickName=Okay! Let me check your nick, 
congratsAvailableNick=Hurray! Your nick is available. Nice to meet you :smile:
getFirstTask=[{"type": "section","text": {"type": "mrkdwn","text": "This is your first <https://github.com/Broscorp-net/traineeship/tree/master/module1/src/main/java/net/broscorp/checkstyle|TASK>. gl"}}]
failedCheckNickName=Sry but looks like you are still not added to our team in Git :worried:
doNotUnderstandWhatTodo=I do not understand what you want, please call the admin!

#to refactor text use stringEscapeTest
agreeMessage =[{"type": "header","text": {"type": "plain_text","text": "\u041C\u044B \u0441\u043E\u0431\u0440\u0430\u043B\u0438\u0441\u044C \u0437\u0434\u0435\u0441\u044C, \u0447\u0442\u043E\u0431\u044B \u0441\u0442\u0430\u0442\u044C \u043A\u0440\u0443\u0442\u044B\u043C\u0438 \u043A\u043E\u043C\u0435\u0440\u0447\u0435\u0441\u043A\u0438\u043C\u0438 \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u0447\u0438\u043A\u0430\u043C\u0438\uD83D\uDE0A","emoji": true}},{"type": "context","elements": [{"type": "plain_text","text": "\u0414\u043B\u044F \u043D\u0430\u0447\u0430\u043B\u0430 \u0440\u0430\u0437\u0431\u0435\u0440\u0435\u043C\u0441\u044F \u0441 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0438\u044F\u043C\u0438:","emoji": true}]},{"type": "context","elements": [{"type": "mrkdwn","text": "*\u041A\u0442\u043E \u0442\u0430\u043A\u043E\u0439 \u043A\u043E\u043C\u0435\u0440\u0447\u0435\u0441\u043A\u0438\u0439 \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u0447\u0438\u043A?* \u2013 \u042D\u0442\u043E \u0447\u0435\u043B\u043E\u0432\u0435\u043A, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u043F\u0440\u0438\u043D\u043E\u0441\u0438\u0442 \u0431\u0438\u0437\u043D\u0435\u0441\u0443 \u0434\u0435\u043D\u044C\u0433\u0438."}]},{"type": "context","elements": [{"type": "mrkdwn","text": "*\u041A\u0430\u043A \u043E\u043D \u043C\u043E\u0436\u0435\u0442 \u044D\u0442\u043E \u0434\u0435\u043B\u0430\u0442\u044C?* \u2013 \u0420\u0430\u0437\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u0442\u044C \u0441\u043E\u0444\u0442, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0437\u0430\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u0435\u0442 \u0438\u043B\u0438 \u044D\u043A\u043E\u043D\u043E\u043C\u0438\u0442 \u0434\u0435\u043D\u044C\u0433\u0438. \u0414\u043B\u044F \u044D\u0442\u043E\u0433\u043E \u043E\u043D \u0434\u043E\u043B\u0436\u0435\u043D, \u0437\u0430\u0442\u0440\u0430\u0442\u0438\u0432 \u043C\u0438\u043D\u0438\u043C\u0430\u043B\u044C\u043D\u043E\u0435 \u043A\u043E\u043B\u0438\u0447\u0435\u0441\u0442\u0432\u043E \u0440\u0435\u0441\u0443\u0440\u0441\u043E\u0432, \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u0430\u0442\u044C \u0441\u043E\u0444\u0442, \u0438\u043C\u0435\u044E\u0449\u0438\u0439 \u0432\u043D\u0443\u0442\u0440\u0435\u043D\u043D\u0435\u0435 \u0438 \u0432\u043D\u0435\u0448\u043D\u0435\u0435 \u043A\u0430\u0447\u0435\u0441\u0442\u0432\u043E. \\n\\n \\t*\u0412\u043D\u0435\u0448\u043D\u0435\u0435 \u043A\u0430\u0447\u0435\u0441\u0442\u0432\u043E* \u2013 \u043D\u0430 \u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0445\u043E\u0440\u043E\u0448\u043E \u0441\u043E\u0444\u0442 \u0440\u0435\u0448\u0430\u0435\u0442 \u0431\u0438\u0437\u043D\u0435\u0441 \u0437\u0430\u0434\u0430\u0447\u0443. \\n \\t*\u0412\u043D\u0443\u0442\u0440\u0435\u043D\u043D\u0435\u0435 \u043A\u0430\u0447\u0435\u0441\u0442\u0432\u043E* \u2013 \u043D\u0430 \u0441\u043A\u043E\u043B\u044C\u043A\u043E \u043B\u0435\u0433\u043A\u043E \u0441\u043E\u0437\u0434\u0430\u043D\u043D\u044B\u0439 \u0441\u043E\u0444\u0442 \u0440\u0430\u0437\u0432\u0438\u0432\u0430\u0442\u044C, \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0442\u044C, \u0430 \u0442\u0430\u043A\u0436\u0435 \u043A\u0430\u043A \u043B\u0435\u0433\u043A\u043E \u0435\u0433\u043E \u043F\u043E\u043D\u0438\u043C\u0430\u0442\u044C \u0434\u0440\u0443\u0433\u0438\u043C \u0447\u043B\u0435\u043D\u0430\u043C \u043A\u043E\u043C\u0430\u043D\u0434\u044B."}]},{"type": "context","elements": [{"type": "mrkdwn","text": "\\n *\u041A\u0430\u043A\u0438\u043C\u0438 \u043D\u0430\u0432\u044B\u043A\u0430\u043C\u0438 \u043E\u0431\u043B\u0430\u0434\u0430\u0435\u0442 \u043A\u0440\u0443\u0442\u043E\u0439 \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u0447\u0438\u043A?* \u2013 \u041A\u0440\u043E\u043C\u0435 \u0442\u0435\u0445\u043D\u0438\u0447\u0435\u0441\u043A\u0438\u0445 \u043D\u0430\u0432\u044B\u043A\u043E\u0432, \u043A\u0440\u0443\u0442\u043E\u0439 \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u0447\u0438\u043A \u043E\u0431\u043B\u0430\u0434\u0430\u0435\u0442 \u00ABsoft skills\u00BB. \u0412 \u043F\u0435\u0440\u0432\u0443\u044E \u043E\u0447\u0435\u0440\u0435\u0434\u044C \u044D\u0442\u043E *\u0443\u043C\u0435\u043D\u0438\u0435 \u043F\u043E\u043C\u043E\u0433\u0430\u0442\u044C* \u0447\u043B\u0435\u043D\u0430\u043C \u043A\u043E\u043C\u0430\u043D\u0434\u044B. \u0420\u0430\u0431\u043E\u0442\u0430\u044F \u0432 \u043A\u043E\u043C\u0430\u043D\u0434\u0435, \u043C\u044B \u043C\u043E\u0436\u0435\u043C \u043F\u0440\u0438\u0443\u043C\u043D\u043E\u0436\u0438\u0442\u044C \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u044B \u0441\u0432\u043E\u0438\u0445 \u0443\u0441\u0438\u043B\u0438\u0439, \u043D\u0430\u0443\u0447\u0438\u0432 \u043B\u044E\u0434\u0435\u0439 \u0442\u043E\u043C\u0443, \u0447\u0442\u043E \u0443\u043C\u0435\u0435\u043C, \u0438 \u0443\u0447\u0430\u0441\u044C \u0443 \u043D\u0438\u0445. \u0412\u0430\u0436\u043D\u043E\u0439 \u0447\u0430\u0441\u0442\u044C\u044E \u044D\u0442\u043E\u0433\u043E \u043D\u0430\u0432\u044B\u043A\u0430 \u0435\u0441\u0442\u044C *\u0443\u043C\u0435\u043D\u0438\u0435 \u043A\u0440\u0438\u0442\u0438\u043A\u043E\u0432\u0430\u0442\u044C \u043A\u043E\u043D\u0441\u0442\u0440\u0443\u043A\u0442\u0438\u0432\u043D\u043E*. \\n\\n*\u041C\u044B \u043D\u0435 \u0433\u043E\u0432\u043E\u0440\u0438\u043C, \u0447\u0442\u043E \u0441\u0434\u0435\u043B\u0430\u043D\u043E \u043F\u043B\u043E\u0445\u043E, \u0430 \u0433\u043E\u0432\u043E\u0440\u0438\u043C, \u0447\u0442\u043E \u043C\u043E\u0436\u043D\u043E \u0441\u0434\u0435\u043B\u0430\u0442\u044C \u043B\u0443\u0447\u0448\u0435 \u0438 \u043F\u043E\u0447\u0435\u043C\u0443!*"}]},{"type": "context","elements": [{"type": "mrkdwn","text": " ```\u0418\u0442\u043E\u0433\u043E, \u043D\u0430\u0448\u0438 \u043F\u0440\u0438\u043D\u0446\u0438\u043F\u044B: \\n\\t\u0426\u0435\u043B\u044C \u0440\u0430\u0431\u043E\u0442\u044B \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u0447\u0438\u043A\u0430 \u2013 \u0437\u0430 \u043C\u0438\u043D\u0438\u043C\u0430\u043B\u044C\u043D\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0441\u0434\u0435\u043B\u0430\u0442\u044C \u043C\u0430\u043A\u0441\u0438\u043C\u0430\u043B\u044C\u043D\u043E \u043A\u0430\u0447\u0435\u0441\u0442\u0432\u0435\u043D\u043D\u043E\u0435 \u041F\u041E, \u043C\u044B \u0445\u043E\u0442\u0438\u043C \u0441\u043E\u0432\u0435\u0440\u0448\u0435\u043D\u0441\u0442\u0432\u043E\u0432\u0430\u0442\u044C \u044D\u0442\u043E\u0442 \u043D\u0430\u0432\u044B\u043A. \\n\\t\u0412\u0437\u0430\u0438\u043C\u043E\u043F\u043E\u043C\u043E\u0449\u044C \u2013 \u043C\u044B \u0440\u0430\u0431\u043E\u0442\u0430\u0435\u043C \u0432 \u043A\u043E\u043C\u0430\u043D\u0434\u0435 \u0438 \u043F\u043E\u043C\u043E\u0433\u0430\u0435\u043C \u0434\u0440\u0443\u0433 \u0434\u0440\u0443\u0433\u0443.\\n\\t\u041A\u043E\u043D\u0441\u0442\u0440\u0443\u043A\u0442\u0438\u0432\u043D\u0430\u044F \u043A\u0440\u0438\u0442\u0438\u043A\u0430 \u2013 \u043C\u044B \u0433\u043E\u0432\u043E\u0440\u0438\u043C, \u0447\u0442\u043E \u043C\u043E\u0436\u043D\u043E \u0441\u0434\u0435\u043B\u0430\u0442\u044C \u043B\u0443\u0447\u0448\u0435, \u0430 \u043D\u0435 \u0447\u0442\u043E \u0441\u0434\u0435\u043B\u0430\u043D\u043E \u043F\u043B\u043E\u0445\u043E.```"}]},{"type": "context","elements": [{"type": "mrkdwn","text": "`If you agree, enter \\"I agree\\" to continue.`"}]}]
firstAgreeMessage = [{"type": "header","text": {"type": "plain_text","text": "\u041E\u0421\u041D\u041E\u0412\u041D\u042B\u0415 \u041F\u0420\u0410\u0412\u0418\u041B\u0410","emoji": true}},{"type": "divider"},{"type": "context","elements": [{"type": "mrkdwn","text": " 1.   \u041A\u043E\u0434 \u0444\u043E\u0440\u043C\u0430\u0442\u0438\u0440\u0443\u0435\u0442\u0441\u044F \u0432 \u0441\u043E\u043E\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0438\u0438 \u0441 *Google code style*. \\n\u041D\u0430\u0441\u0442\u0440\u043E\u0439\u043A\u0438 \u0434\u043B\u044F \u0441\u0440\u0435\u0434\u044B \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u043A\u0438 (https://github.com/google/styleguide): \\n <https://github.com/google/styleguide/blob/gh-pages/intellij-java-google-style.xml|IntelliJ IDEA> \\n <https://github.com/google/styleguide/blob/gh-pages/eclipse-java-google-style.xml|Eclipse>"}]},{"type": "context","elements": [{"type": "mrkdwn","text": "  2.   \u0412\u0441\u0435 \u043F\u0440\u043E\u0435\u043A\u0442\u044B \u0441\u043E\u0431\u0438\u0440\u0430\u044E\u0442\u0441\u044F \u0441 \u043F\u043E\u043C\u043E\u0449\u044C\u044E *Maven*."}]},{"type": "context","elements": [{"type": "mrkdwn","text": "3. \u0424\u0430\u0439\u043B\u044B \u0441\u0440\u0435\u0434\u044B \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u043A\u0438 \u0438 \u043F\u0440\u043E\u0447\u0438\u0435 \u0432\u0440\u0435\u043C\u0435\u043D\u043D\u044B\u0435 \u0444\u0430\u0439\u043B\u044B \u043D\u0435 \u0434\u043E\u043B\u0436\u043D\u044B \u043F\u043E\u043F\u0430\u0434\u0430\u0442\u044C \u0432 \u0440\u0435\u043F\u043E\u0437\u0438\u0442\u043E\u0440\u0438\u0439 (https://github.com/github/gitignore)."}]},{"type": "context","elements": [{"type": "mrkdwn","text": "4.   \u041F\u043E\u043A\u0440\u044B\u0442\u0438\u0435 \u043A\u043E\u0434\u0430 *Unit tests* (Junit5): \\n\\t\u0422\u0435\u0441\u0442 \u043F\u0440\u043E\u0432\u0435\u0440\u044F\u0435\u0442 \u043E\u0434\u0438\u043D \u043A\u0443\u0441\u043E\u043A \u043B\u043E\u0433\u0438\u043A\u0438 \u0437\u0430 \u0440\u0430\u0437. \u0422\u043E \u0435\u0441\u0442\u044C, \u0435\u0441\u043B\u0438 \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E \u043F\u0440\u043E\u0432\u0435\u0440\u0438\u0442\u044C \u043A\u0430\u043A \u0440\u0430\u0431\u043E\u0442\u0430\u0435\u0442 \u043C\u0435\u0442\u043E\u0434, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u043C\u044B \u043F\u0440\u043E\u0432\u0435\u0440\u044F\u0435\u043C \u0441 \u043F\u0440\u0430\u0432\u0438\u043B\u044C\u043D\u044B\u043C\u0438 \u0434\u0430\u043D\u043D\u044B\u043C\u0438 \u2013 \u044D\u0442\u043E _\u043E\u0434\u0438\u043D \u0442\u0435\u0441\u0442_. \u0415\u0441\u043B\u0438 \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E \u043F\u0440\u043E\u0432\u0435\u0440\u0438\u0442\u044C \u043A\u0430\u043A \u0440\u0430\u0431\u043E\u0442\u0430\u0435\u0442 \u043C\u0435\u0442\u043E\u0434 \u0441 \u0434\u0440\u0443\u0433\u0438\u043C\u0438 \u0434\u0430\u043D\u043D\u044B\u043C\u0438 - _\u0432\u0442\u043E\u0440\u043E\u0439 \u0442\u0435\u0441\u0442_. \\n\\n *\u0422\u0435\u0441\u0442 \u043F\u0438\u0448\u0435\u0442\u0441\u044F \u043F\u043E \u043F\u0440\u0438\u043D\u0446\u0438\u043F\u0443:* \\n\\t 1.  \u041F\u043E\u0434\u0433\u043E\u0442\u043E\u0432\u043A\u0430 \u0442\u0435\u0441\u0442\u043E\u0432\u044B\u0445 \u0434\u0430\u043D\u043D\u044B\u0445. \\n\\t 2.  \u0418\u0441\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u0435 \u043C\u0435\u0442\u043E\u0434\u0430, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u043C\u044B \u0442\u0435\u0441\u0442\u0438\u0440\u0443\u0435\u043C. \\n\\t 3.  \u041F\u0440\u043E\u0432\u0435\u0440\u043A\u0430 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u0430."}]},{"type": "context","elements": [{"type": "mrkdwn","text": "`If you agree, enter \\"I agree\\" to continue.`"}]}]
secondAgreeMessage=[{"type": "header","text": {"type": "plain_text","text": "\u041F\u0420\u0410\u0412\u0418\u041B\u0410 \u0412\u042B\u041F\u041E\u041B\u041D\u0415\u041D\u0418\u042F \u0417\u0410\u0414\u0410\u041D\u0418\u042F","emoji": true}},{"type": "divider"},{"type": "context","elements": [{"type": "mrkdwn","text": "\u041F\u0435\u0440\u0432\u043E\u0435, \u0447\u0442\u043E \u0442\u0435\u0431\u0435 \u043D\u0443\u0436\u043D\u043E \u0441\u0434\u0435\u043B\u0430\u0442\u044C - *Fork* \u0440\u0435\u043F\u043E\u0437\u0438\u0442\u043E\u0440\u0438\u0439. \u0415\u0441\u043B\u0438 \u0442\u044B \u0444\u043E\u0440\u043A\u043D\u0443\u043B \u0440\u0435\u043F\u043E\u0437\u0438\u0442\u043E\u0440\u0438\u0439 \u043D\u0435 \u0442\u043E\u043B\u044C\u043A\u043E \u0447\u0442\u043E, \u0430 \u0443\u0436\u0435 \u0434\u0430\u0432\u043D\u043E \u0440\u0430\u0431\u043E\u0442\u0430\u0435\u0448\u044C \u043D\u0430\u0434 \u0437\u0430\u0434\u0430\u043D\u0438\u044F\u043C\u0438 \u2013 \u0442\u0435\u0431\u0435 \u043D\u0443\u0436\u043D\u043E \u043E\u0431\u043D\u043E\u0432\u0438\u0442\u044C\u0441\u044F. <thttps://help.github.com/en/github/collaborating-with-issues-and-pull-requests/merging-an-upstream-repository-into-your-fork|\u0418\u043D\u0441\u0442\u0440\u0443\u043A\u0446\u0438\u044F \u043A\u0430\u043A \u044D\u0442\u043E \u0441\u0434\u0435\u043B\u0430\u0442\u044C.> \\n \u0415\u0441\u043B\u0438 \u0442\u044B \u0434\u0438\u0441\u0446\u0438\u043F\u043B\u0438\u043D\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u043E \u0441\u043E\u0437\u0434\u0430\u0432\u0430\u043B \u0432\u0435\u0442\u043A\u0438 \u0438 \u043D\u0435 \u0434\u043E\u0431\u0430\u0432\u043B\u044F\u043B \u043A\u043E\u043C\u043C\u0438\u0442\u044B \u0432 master \u0442\u043E \u0432\u0441\u0435 \u0434\u043E\u043B\u0436\u043D\u043E \u043F\u0440\u043E\u0439\u0442\u0438 \u0431\u0435\u0437 \u043A\u043E\u043D\u0444\u043B\u0438\u043A\u0442\u043E\u0432 =)"}]},{"type": "header","text": {"type": "plain_text","text": "\u041A\u0430\u0436\u0434\u043E\u0435 \u043D\u043E\u0432\u043E\u0435 \u0437\u0430\u0434\u0430\u043D\u0438\u0435 \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E \u0432\u044B\u043F\u043E\u043B\u043D\u044F\u0442\u044C \u043F\u043E \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0435\u043C\u0443 \u0430\u043B\u0433\u043E\u0440\u0438\u0442\u043C\u0443:","emoji": true}},{"type": "context","elements": [{"type": "mrkdwn","text": "1.    \u041A\u0430\u0436\u0434\u043E\u0435 \u0437\u0430\u0434\u0430\u043D\u0438\u0435 \u2013 *\u043E\u0442\u0434\u0435\u043B\u044C\u043D\u0430\u044F \u0432\u0435\u0442\u043A\u0430*. \u0421\u0434\u0435\u043B\u0430\u0439 \u0432\u0435\u0442\u043A\u0443 \u0434\u043B\u044F \u0437\u0430\u0434\u0430\u043D\u0438\u044F \u0438 \u0432\u044B\u043F\u043E\u043B\u043D\u044F\u0439 \u0435\u0433\u043E \u0432 \u0441\u043E\u043E\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0438\u0438 \u0441 \u0438\u043D\u0441\u0442\u0440\u0443\u043A\u0446\u0438\u044F\u043C\u0438. \u0418\u043C\u044F \u0432\u0435\u0442\u043A\u0438 \u0434\u043E\u043B\u0436\u043D\u043E *\u0441\u043E\u0432\u043F\u0430\u0434\u0430\u0442\u044C* \u0441 \u0438\u043C\u0435\u043D\u0435\u043C \u043F\u0430\u043A\u0435\u0442\u0430 \u0437\u0430\u0434\u0430\u043D\u0438\u044F."}]},{"type": "context","elements": [{"type": "mrkdwn","text": "2.    \u0421\u0434\u0435\u043B\u0430\u0439 *pull request* \u0438\u0437 \u044D\u0442\u043E\u0439 \u0432\u0435\u0442\u043A\u0438 \u0432 \u043D\u0430\u0448 \u0440\u0435\u043F\u043E\u0437\u0438\u0442\u043E\u0440\u0438\u0439. \u0418\u043C\u044F pull request \u0434\u043E\u043B\u0436\u043D\u043E *\u0441\u043E\u0432\u043F\u0430\u0434\u0430\u0442\u044C* \u0441 \u0438\u043C\u0435\u043D\u0435\u043C \u043F\u0430\u043A\u0435\u0442\u0430 \u0437\u0430\u0434\u0430\u043D\u0438\u044F."}]},{"type": "context","elements": [{"type": "mrkdwn","text": "\u041C\u044B \u043F\u0440\u043E\u0432\u0435\u0440\u0438\u043C \u0437\u0430\u0434\u0430\u043D\u0438\u0435, \u043F\u043E\u0434\u0441\u043A\u0430\u0436\u0435\u043C \u0447\u0442\u043E \u043D\u0443\u0436\u043D\u043E \u0438\u0441\u043F\u0440\u0430\u0432\u0438\u0442\u044C \u0438 \u043F\u0440\u0438\u043C\u0435\u043C \u0437\u0430\u0434\u0430\u043D\u0438\u0435. \u0415\u0441\u043B\u0438 \u0447\u0442\u043E-\u0442\u043E \u043D\u0430\u0434\u043E \u043F\u043E\u043C\u0435\u043D\u044F\u0442\u044C \u043C\u044B \u0434\u043E\u0431\u0430\u0432\u0438\u043C \u043C\u0435\u0442\u043A\u0443 *changes requested*.\\n\\n\u0415\u0441\u043B\u0438 \u044D\u0442\u043E \u043F\u0440\u043E\u0438\u0437\u043E\u0448\u043B\u043E: \\n\\t1.   \u0418\u0441\u043F\u0440\u0430\u0432\u044C, \u043F\u043E\u0436\u0430\u043B\u0443\u0439\u0441\u0442\u0430, \u0437\u0430\u043C\u0435\u0447\u0430\u043D\u0438\u044F. \\n\\t2.   \u0423\u0434\u0430\u043B\u0438 \u043C\u0435\u0442\u043A\u0443 *changes requested* \u0438 \u0434\u043E\u0431\u0430\u0432\u044C \u043C\u0435\u0442\u043A\u0443 *ready for review*. \\n\\t3.   \u041C\u0435\u0442\u043A\u0430 *done* \u2013 \u0437\u0430\u0434\u0430\u043D\u0438\u0435 \u043F\u0440\u0438\u043D\u044F\u0442\u043E."}]},{"type": "context","elements": [{"type": "mrkdwn","text": "```\u0415\u0441\u043B\u0438 \u0442\u044B \u043D\u0435 \u043C\u043E\u0436\u0435\u0448\u044C \u043C\u0435\u043D\u044F\u0442\u044C \u043C\u0435\u0442\u043A\u0438 \u2013 \u0437\u043D\u0430\u0447\u0438\u0442 \u043C\u044B \u043F\u0440\u043E\u0432\u0442\u044B\u043A\u0430\u043B\u0438 \u0438 \u043D\u0435 \u0434\u043E\u0431\u0430\u0432\u0438\u043B\u0438 \u0442\u0435\u0431\u044F \u0432 \u043A\u043E\u043C\u0430\u043D\u0434\u0443 (\u0438\u043B\u0438 \u0434\u043E\u0431\u0430\u0432\u0438\u043B\u0438, \u043D\u043E \u043F\u0440\u0438\u0433\u043B\u0430\u0448\u0435\u043D\u0438\u0435 \u043D\u0435 \u0431\u044B\u043B\u043E \u043F\u0440\u0438\u043D\u044F\u0442\u043E, \u0442\u0430\u043A \u0447\u0442\u043E \u043F\u0440\u043E\u0432\u0435\u0440\u044C \u043F\u043E\u0447\u0442\u0443) \u2013 \u043D\u0430\u043F\u0438\u0448\u0438 \u043E\u0431 \u044D\u0442\u043E\u043C Liliya Stepanovna \u0432 \u0441\u043B\u0435\u043A\u0435.```"}]},{"type": "context","elements": [{"type": "mrkdwn","text": "`If you agree, enter \\"I agree\\" to continue.`"}]}]
usersAgreeMessage=I agree

addGitName=[{"type": "section","text": {"type": "mrkdwn","text":"So, that's it. You've read through all our rules. \\nIf you're ready to accept this challenge, join to our team on <https://github.com|GitHub> and after doing that enter your GitHub nickname."}}]
noOneCase=[{"type": "divider"},{"type": "section","text": {"type": "mrkdwn","text": "NO ONE CASE "},"accessory": {"type": "button","text": {"type": "plain_text","text": "Button","emoji": true},"value": "Button"}}]
notThatMessage=[{"type": "section","text": {"type": "mrkdwn","text": "Please answer the latest message :ghost:"}}]
lastTask =You are so cool! :tada: Just one step away from finishing your set of tasks. Make your last task, send it and wait for the review. Also you can help your colleagues on their journey :hugging_face:

tasksForUsers=checkstyle, primitives, boxing, valueref, equals/hashcode, patform, bytecode, gc, exceptions, classpath, generics, inner/classes, override/overload, strings
#git check new request
git.check.label=labeled
git.check.new.req=opened
git.number.of.tasks=13
